"use client";
import React from "react";
import Footer from "@/components/homePage/Footer";
import SecondaryHeader from "@/components/homePage/SecondaryHeader";

const Privacy = () => {
  return (
    <div className="flex flex-col min-h-screen w-screen items-center justify-between">
      <SecondaryHeader />
      <div className="w-full flex flex-col items-center justify-start px-4 md:px-6 lg:px-8">
        <div className="max-w-[1120px] flex flex-col gap-4 mt-[30px] mb-[40px]">
          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Нууцлалын бодлого
          </div>
          <div className="">Үйлчилж эхэлсэн: 2024/09/02</div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Иннэрхийл нь хэрэглэгчийн аюулгүй байдал болон нууцлалыг чухалчилан
            авч үздэг бөгөөд энэхүү баримтад таны хувийн мэдээлэл, аюулгүй
            байдал хэрхэн хамгаалагдаж буй талаар тусгасан болно.
          </div>

          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Дата хамгаалалт
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Хэрэглэгчийн мэдээллийг хамгаалах тухай хуулийн дагуу бид таны датаг
            хамгаалдаг. Хэрвээ та бидэнтэй холбогдохыг хүсвэл СБД, 1-р хороо,
            Чингисийн өргөн чөлөө, Гурван гол оффис центр 3 давхар, (+976)
            7270-0800, social@pinecone.mn хаягаар холбогдох боломжтой.
          </div>

          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Бид хэрэглэгчийн ямар мэдээллийг цуглуулдаг вэ?
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Иннэрхийлийг ашиглахад бид танаас дараах мэдээлэл цуглуулах
            шаардлагатай болно.
            <br />
            Таны байршил, Аливаа нэг байгууллагатай холбоотой эсэх, төрсөн
            огноо. Бид танд үйлчилгээ үзүүлэхийн тулд эдгээр мэдээлэл нь
            шаардлагатай. Энэхүү мэдээллийг боловсруулах хууль эрхзүйн үндэслэл
            нь танд гэрээний үйлчилгээ үзүүлэх явдал юм. Бид мөн нас, хүйс,
            угсаатны бүрэлдэхүүн зэрэг бусад мэдээллийг цуглуулдаг. Энэ мэдээлэл
            нь бидэнд танд болон иргэдийн өргөн хүрээнд үйлчилгээгээ
            сайжруулахад тусалдаг. Таны хүйсийн тодорхойлолт Таны угсаатны
            бүрэлдэхүүн Энэхүү мэдээллийг "хууль ёсны ашиг сонирхол" гэсэн хууль
            эрх зүйн үндэслэлийн дагуу цуглуулдаг. Энэ нь бидний үйлчилгээний
            гүйцэтгэлийг хэмжиж, үйлчилгээгээ сайжруулахад тусалдаг. Мөн
            үйлчилгээг танд хүргэж буй байгууллагуудтай хуваалцдаг. Хуваалцсан
            мэдээлэл бүрэн нууцлагдсан бөгөөд хувь хүнийг таних боломжгүй юм.
            Энэ нь байгууллагуудад Qwell үйлчилгээг хэрхэн ашиглаж байгааг
            ойлгоход тусалдаг. Үүнд дараах зүйлс орно: Бүртгэлийн тоо Qwell
            сайтын хэрэглээ Үйлчлүүлэгчдийн тулгарч буй асуудал Хүрсэн үр дүн.
            Энэ бол хувийн мэдээлэл боловч хувь хүнийг ТАНИХГҮЙ бөгөөд биднийг
            хувь хүнийг ДАГАХ, ОЛОХ боломжийг олгодоггүй. Хэрэв та илгээлтийн
            замналаас ирэхгүй бол бид танаас бүртгүүлэх үед мэдээлэл асуудаггүй.
          </div>

          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Иннэрхийл дээрх cookie-н хэрэглээ
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Иннэрхийл дээрх cookie-ийн хэрэглээний талаар эндээс уншина уу.
            Иннэрхийл-д гадны үйлчилгээ эсвэл гуравдагч этгээдээс илгээмж илгээх
            Заримдаа хүмүүсийг таны гэр бүл эсвэл таны ажиллаж байсан өөр нэг
            үйлчилгээ зэрэг гуравдагч этгээд манай үйлчилгээнд илгээдэг. Хэрэв
            та Иннэрхийл-д илгээмж илгээсэн бол тэд таны Хувийн мэдээллийг
            бидэнтэй хуваалцдаг. Бид таны хувийн мэдээллийг таны дансны
            нууцлагдсан хэсэгт хадгалах бөгөөд зөвхөн Иннэрхийл багийн гишүүд
            үүнийг харж болно. Энэхүү мэдээллийг зөвхөн доорх Хамгаалалтын
            хэсэгт тайлбарласан нөхцөлд ашигладаг.
          </div>

          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Бид өөр ямар хувийн мэдээлэл хадгалдаг вэ?
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Заримдаа үйлчлүүлэгчид бидэнд асуугаагүй хувийн мэдээлэл өгч болно.
            Жишээлбэл, хэрэв та Мессеж самбар ашигладаг эсвэл сэтгүүлд нийтлэл
            бичдэг бол бидний модераторууд энэ мэдээллийг нийтлэгдэхгүй гэдэгт
            итгэлтэй байх болно. Тэд таны нууцлалыг хамгаалахын тулд таны бичлэг
            эсвэл нийтлэлийг хэрхэн засах талаар ярилцахын тулд танд мессеж
            илгээж болно. Таны өгсөн хувийн мэдээлэл эсвэл дотоод вэбсайтын
            хайлтын асуултыг манай платформ дээрх таны профайл дээр хадгалдаг.
            Хэрэв та бидэнд хувийн мэдээлэл өгвөл та бидэнд "нууц биш" болж
            магадгүй юм. Жишээлбэл, бид таныг хэн бэ, хаана байгааг мэдэж болно.
          </div>

          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Бид таны хувийн мэдээллийг өөр хүнтэй хуваалцдаг уу?
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Бид таны сайн сайхны төлөө анхаарал халамж тавих үүрэгтэй. Хэрэв бид
            таны талаар санаа зовж байвал Qwell багийн гаднах хэн нэгэн танд юу
            болж байгааг мэдэх шаардлагатай гэж тантай ярилцах болно. Бид зөвхөн
            дараах тохиолдолд л үүнийг хийх болно: таны хийсэн зүйлийн улмаас
            таны амь насанд аюул учрах магадлалтай, та өөр хүнээс болж аюулд
            өртөж байна, та өөр хүнд аюул учруулж байна. Эдгээр тохиолдолд манай
            мэргэжилтнүүд таныг шаардлагатай үйлчилгээнд илгээх эсвэл
            шаардлагатай тусламжийг авахын тулд таны мэдээллийг хуваалцах
            зөвшөөрөл авах болно. Хэрэв та зөвшөөрөхгүй бөгөөд манай мэргэжилтэн
            үүнийг хамгаалах асуудал гэж үзвэл тэд бидний мэдээллийг
            илгээх/хуваалцах боломжтой. Энэ тохиолдолд бид: Бид хэнд ямар
            мэдээлэл дамжуулж байгааг танд мэдэгдэх болно, Бид хийх гэж буй
            аливаа үйлдлийн талаар танд мэдэгдэх болно, Боломжтой бол бид хийх
            бүх алхмыг тохиролцохын тулд тантай хамтран ажиллах болно. Заримдаа
            нөхцөл байдал маш ноцтой бол бид тантай урьдчилан ярилцахгүйгээр
            арга хэмжээ авах шаардлагатай болдог. Qwell-ээс гадаад үйлчилгээнд
            илгээмж илгээх Заримдаа танд нэмэлт тусламж авах нь тустай байж
            болно. Та амьдарч буй газраасаа хамааран танай нутаг дэвсгэрт өөр
            үйлчилгээнд илгээмж илгээх сонголтыг санал болгож болно. Эдгээр
            үйлчилгээг Qwell эсвэл түнш байгууллага үйлчилж болно. Хэрэв та
            өөрөө илгээмж илгээвэл байгууллагад шууд хувийн мэдээлэл өгч болно.
            Хэрэв та Qwell багийнхан таны өмнөөс илгээмж илгээхийг хүсвэл
            илгээмжийг гүйцэтгэхийн тулд бидэнд дамжуулах хувийн мэдээллийг
            хуваалцах шаардлагатай болно. Энэ хувийн мэдээллийг Qwell
            платформоор хадгалах бөгөөд зөвхөн Qwell баг болон таны илгээгдэх
            байгууллага л нэвтрэх боломжтой. Бид таны мэдээллийг дамжуулах, хэнд
            дамжуулж байгааг танд мэдэгдэхийн тулд таны зөвшөөрлийг үргэлж
            эрэлхийлнэ.
          </div>

          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Бид таны мэдээллийг хаана, хэр хугацаанд хадгалдаг вэ?
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Бүх мэдээллийг Innerheal Platform дотор аюулгүй хадгалдаг бөгөөд
            зөвхөн Innerheal баг л нэвтрэх боломжтой. Манай системүүд мэдээлэл
            хадгалагдаж байгаа газар болон хэрэглэгч болон манай системүүдийн
            хооронд, манай систем дотор шилжүүлэгдэж байгаа газар нууцлагдсан
            (таны мэдээллийг хамгаалах кодолсон) байдаг. Kooth нь хостинг
            хийхдээ Google Cloud Platform-ийн europe-west-2 бүс (Лондон, Их
            Британи)-ыг ашигладаг. Kooth мэдээллийг Google Cloud Platform-ийн
            europe-west-2 бүс (Лондон)-д байршуулсан болно. Бид танд үйлчилгээ
            үзүүлэх, мөн хууль эрх зүйн үүргээ биелүүлэхийн тулд шаардлагатай
            хэмжээгээр таны хувийн мэдээллийг хадгалдаг. Бид таны үйлчилгээг
            ашиглахаа больсны дараа 7 жилийн турш таны хувийн мэдээллийг
            хадгалдаг. Зарим тохиолдолд бид хууль ёсоор илүү удаан хадгалах
            шаардлагатай болдог.
          </div>

          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Таны Өгөгдөл - Таны Эрх
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Таны хувийн мэдээллийг эзэмшигч (буюу "Өгөгдлийн эзэн") таньд
            Ерөнхий Мэдээлэл Хамгаалах Дүрэм журам (GDPR)-ын дагуу бидний таны
            хувийн мэдээллийг хэрхэн ашигладаг талаар мэдэх эрхтэй. <br />
            Та дараах эрхтэй:
            <div className="pl-5 pt-5">
              <ul className="list-disc list-outside">
                <li>
                  Мэдээлэл авах эрх - Бид энэхүү баримт бичгийг танд өгснөөр
                  таны цуглуулсан болон хадгалсан хувийн мэдээлэл танд хүргэгдэж
                  байна.
                </li>
                <li>
                  Нэвтрэх эрх - Та бидний хадгалж буй хувийн мэдээллээсээ асууж
                  болно - энэ нь "өгөгдлийн субъектын хандалтын хүсэлт" гэж
                  нэрлэгддэг.
                </li>
                <li>
                  Засварлах эрх - Та бидний хадгалж буй мэдээлэл буруу эсвэл
                  дутуу байгааг мэдэгдэж, бидэнд засаж залруулахыг хүсэх
                  боломжтой.
                </li>
                <li>
                  Устгах эрх - Та хувийн мэдээллээ устгахыг хүсэх боломжтой. Энэ
                  нь танд биднийг таны мэдээллийг устгах эсвэл боловсруулахыг
                  зогсоохыг хүсэх боломжийг олгодог. (*Гэхдээ зарим тохиолдолд
                  бид хуулийн дагуу тодорхой хугацаанд хадгалах шаардлагатай тул
                  үүнийг хийж чадахгүй байж магадгүй.)
                </li>
                <li>
                  Боловсруулалтыг хязгаарлах эрх - Та Компани нь боловсруулалтын
                  хууль ёсны үндэслэл болгон хууль ёсны ашиг сонирхлыг ашиглаж
                  байгаа тохиолдолд таны мэдээллийг боловсруулахад эсэргүүцэл
                  үзүүлж болно.
                </li>
                <li>
                  Өгөгдөл шилжүүлэх эрх - Та бидэнд таны хувийн мэдээллийг өөр
                  нэг өгөгдлийн контроллерт аюулгүй шилжүүлэхийг хүсэх
                  боломжтой.
                </li>
                <li>
                  Эсэргүүцэх эрх - Хэрэв мэдээлэл буруу эсвэл түүний үнэн зөв
                  байдал эсвэл боловсруулах шалтгааны талаар маргаантай байгаа
                  бол та тодорхой хугацаанд хувийн мэдээллээ боловсруулахыг
                  зогсоохыг бидэнд хүсэх боломжтой.
                </li>
              </ul>
              Хэрэв та эдгээр зүйлсийн аль нэгийг хийхийг хүсвэл Qwell дансандаа
              нэвтрэн орж, Qwell багийн гишүүнд мессеж илгээж тусламж аваарай.
              Шууд имэйлээр биш харин таны дансны тусламжтайгаар бидэнтэй холбоо
              барьснаар та нууц нэрээ хадгалж чадна. <br />
              Хэрэв та бидний мэдээллийг зохих ёсоор харьцаагүй эсвэл дээр
              дурдсан эрхээ хүлээн зөвшөөрөөгүй гэж үзвэл та Мэдээллийн
              комиссарын газарт гомдол гаргаж болно.
            </div>
          </div>

          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Таны зөвшөөрлөө цуцлах эрх
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Хэрэв та бидэнтэй ямар нэгэн хувийн мэдээлэл хуваалцсан бол та
            зөвшөөрлөө цуцлах эрхтэй. Та хэдийд ч мэдээлэл хуваалцах зөвшөөрлөө
            цуцалж болно. Та Qwell багт мессеж илгээснээр зөвшөөрлөө цуцлахыг
            хүсэх боломжтой. <br />
            <br />
            Та ямар нэгэн буруу мэдээллийг засах эсвэл бидний хадгалах
            шаардлагагүй мэдээллийг устгах эрхтэй. Таны хүсэлтийг боловсруулах
            стандарт хүлээх хугацаа хоёр сар юм. <br />
            <br />
            Та Kooth-ийн Нууцлалын бодлого нь гуравдагч этгээдийн вэбсайтуудад
            холбоос дагаснаар үйлчилдэггүй гэдгийг анхаарах хэрэгтэй. Kooth нь
            гуравдагч этгээдийн вэбсайтуудыг хянадаггүй бөгөөд хэрэглэгчид
            тэдний нууцлалын бодлоготой танилцах ёстой.
          </div>

          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Бидний үйлчилгээг хэрхэн сайжруулж байгаа талаарх бусад мэдээлэл
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Бид цуглуулсан мэдээллийг үйлчилгээнийхээ гүйцэтгэлийг хэмжиж,
            үйлчилгээгээ сайжруулахад ашиглаж болно. Энэ мэдээлэл үргэлж
            нууцлагдсан байдаг тул таныг танихын тулд ашиглах боломжгүй юм.
          </div>

          <div className="text-[#102d3f] text-lg font-bold font-['Inter']">
            Өгөгдлийн багасгах
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Таны мэдээллийг боловсруулах нь бидний хууль ёсны ашиг сонирхол
            эсвэл гуравдагч этгээдийн хууль ёсны ашиг сонирхлын хувьд
            шаардлагатай бөгөөд эдгээр ашиг сонирхол нь таны эрх, ашиг сонирхолд
            давуу байхгүй. Манай хууль ёсны ашиг сонирхолд дараах зүйлс орно:
            <div className="pl-5 pt-5">
              <ul className="list-disc list-outside">
                <li>Асуулт хариултад хариу өгөх</li>
                <li>
                  Одоогийн эсвэл ирээдүйн хэрэглэгчдэд холбогдох мэдээлэл хүргэх
                </li>
                <li>Вэбсайтын хэрэглэгчдийн сонирхол, хэрэгцээг ойлгох</li>
                <li>
                  Вэбсайт болон бусад үйлчилгээний гүйцэтгэл, аюулгүй байдлыг
                  хадгалах
                </li>
              </ul>
            </div>
          </div>

          <div className="text-[#102d3f] text-lg font-bold font-['Inter']">
            Автоматжуулалтад холбогдох эрх
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Бид процессууд болон хэрэглэгчийн туршлагаа сайжруулахын тулд машин
            сургалтыг ашиглаж болно. Энэ нь бидэнд үйлчилгээний хэрэглэгчдээ
            илүү сайн ойлгож, үр дүнг сайжруулахад тусалдаг. Машин суралт нь
            автоматаар шийдвэр гаргаж болно. Жишээ нь: Өмнөх хэрэглээнд үндэслэн
            контентийг санал болгох эсвэл; Шуурхай дэмжлэг шаардлагатай
            үйлчилгээний хэрэглэгчдэд анхаарлаа төвлөрүүлэхийн тулд шүүлтүүрийн
            бага эрсдэлтэй бичлэгүүдийг шүүх.
          </div>

          <div className="text-[#102d3f] text-lg font-bold font-['Inter']">
            Судалгааны ажил
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Qwell заримдаа их сургууль, NHS байгууллагууд зэрэг итгэмжлэгдсэн
            түншүүдтэй хамтран ажилладаг. Тэд бидний үйлчилгээг сайжруулахын
            тулд бидний өгөгдлийг шинжлэхэд тусалдаг. <br />
            <br />
            Бид мөн их сургуулийн судлаачидтай хамтран ажилладаг бөгөөд тэд
            өөрсдийн ажлын ёс зүйн баталгааг авдаг. <br />
            <br />
            Бидний тэдэнд өгдөг мэдээлэл нь статистик болон таны бидэнд өгсөн
            мэдээллийн холимог юм. <br />
            <br />
            Статистик мэдээлэлд үйлчилгээний хэрэглэгчдийн нас, үндэс угсаа,
            хүйс зэрэг мэдээлэл орно. Мөн зорилго, үнэлгээ, хэрэглээний мэдээлэл
            зэрэг бусад мэдээлэл багтаж болно. Бусад мэдээлэлд Qwell-д
            хуваалцсан нийтлэг болон хувийн мэдээлэл орно. Нийтлэг мэдээлэл нь
            нийтлэл, ярилцлагын самбар, тайлбар зэргийг хамардаг бөгөөд
            эдгээрийг бусад Qwell үйлчилгээний хэрэглэгчид харж болно. Хувийн
            мэдээлэл нь зөвлөх багтай хийсэн чат эсвэл багийн инбокс руу
            илгээсэн мессеж зэрэг ямар ч харилцааг хамарна. <br />
            <br />
            Энэ нь таныг танихад хүргэх ямар нэгэн хувийн мэдээлэл агуулдаггүй -
            энэ нь бүрэн нууцлагдсан байдаг. Таны илэрхий зөвшөөрөлгүйгээр
            судалгааны зорилгоор ямар нэгэн танигдах мэдээлэл хуваалцдаггүй.{" "}
            <br />
            <br />
            Хэрэв та судалгааны зорилгоор бидний хэрхэн мэдээлэл ашигладаг
            талаар илүү ихийг мэдэхийг хүсвэл багийн инбокс руу мессеж илгээж
            болно.
          </div>

          <div className="text-[#102d3f] text-lg font-bold font-['Inter']">
            Нууцлалын Мэдэгдлийн Өөрчлөлт
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Бид шаардлагатай үед Нууцлалын болон Аюулгүй байдлын Бодлогоо
            шинэчилнэ. Жишээ нь, мэдээлэл цуглуулах зорилго өөрчлөгдсөн
            тохиолдолд. Та ирээдүйд ямар нэгэн өөрчлөлтийн тулд Нууцлалын
            Бодлогоо дахин шалгаж үзэхийг уриалж байна.
          </div>
        </div>
      </div>
      <Footer />
    </div>
  );
};

export default Privacy;
