"use client";
import React from "react";
import Footer from "@/components/homePage/Footer";
import SecondaryHeader from "@/components/homePage/SecondaryHeader";

const TermsOfServiceContent = () => {
  return (
    <div className="flex flex-col min-h-screen w-screen items-center justify-between">
      <SecondaryHeader />
      <div className="w-full flex flex-col items-center justify-start px-4 md:px-6 lg:px-8">
        <div className="max-w-[1120px] flex flex-col gap-4 mt-[30px] mb-[40px]">
          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Үйлчилгээний нөхцөл
          </div>
          <div className="">Үйлчилж эхэлсэн: 2024/09/02</div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Энэ сайтын эзэмшигч, удирдагч нь Иннэрхийл ХХК бөгөөд та дараах
            нөхцөлийг хүлээн зөвшөөрөх үндсэн дээр ашиглаж болно:
            <div className="pl-7 pt-3">
              <ul className="list-disc list-outside">
                <li>
                  Та сайтыг ашигласнаар цаг хугацааны явцад өөрчлөгдөж болох
                  эдгээр нөхцөлийг хүлээн зөвшөөрнө. Хэрэв та бидний нөхцлийг
                  өөрчилсний дараа сайтыг үргэлжлүүлэн ашиглавал та өөрчлөлтийг
                  хүлээн зөвшөөрсөн гэж үзнэ.
                </li>
                <li>
                  Та бүртгүүлэхдээ худал мэдээлэл, тухайлбал төрсөн огноо өгч
                  болохгүй.
                </li>
                <li>
                  Хэрэв та бидний үйл ажиллагаа явуулдаг гэрээний бүс нутгийн
                  аль нэгэнд амьдардаггүй бол Иннэрхийл-д бүртгүүлж болохгүй.
                </li>
                <li>Бусдыг хүндлэх</li>
                <li>
                  Бусад Qwell үйлчилгээний хэрэглэгчид болон Иннэрхийл-н эмч,
                  зөвлөхүүдийн багтай мэндчил.
                </li>
                <li>
                  Бие биендээ энэрэл үзүүл; бүдүүлэг эсвэл доромжлох тайлбар
                  нийтлэгдэхгүй.
                </li>
                <li>
                  Бусдыг хүндэлж, таны хэлсэн үг тэдэнд нөлөөлж болохыг
                  санаарай.
                </li>
                <li>
                  Бусад үйлчилгээний хэрэглэгчдийг дээрэлхэж, муухай аашилж
                  эсвэл хүчирхийлэл, түрэмгий үг хэллэгээр ярих хэрэггүй.
                </li>
                <li>
                  Хэлнийхээ зохистой байдлыг хангаарай - хараал хэлэхээс
                  зайлсхийж, бэлгийн шинжтэй хэл хэллэг хэрэглэхээс зайлсхий.
                  Гомофобик эсвэл үзэн ядсан ямар нэгэн зүйл нийтлэгдэхгүй.
                </li>
                <li>
                  Иннэрхийл дээр үнэнч байж, өөр хүн мэт жүжиглэхгүй байх нь
                  чухал.
                </li>
                <li>
                  Заримдаа та уурлаж, бухимдах мэдрэмж төрж болох ч үүнийг
                  Иннэрхийл-н эмч, зөвлөхүүдийн баг эсвэл сайтын бусад
                  үйлчилгээний хэрэглэгчдэд гаргахгүй байх нь чухал.
                </li>
                <li>
                  Хорон санаатай данс үүсгэх, дарамтлах, зорилтот халдлага,
                  Kooth үйлчилгээний хэрэглэгчид эсвэл манай Kooth эмч,
                  зөвлөхүүдийн багт хортой нөлөө үзүүлж болзошгүй ямар ч төрлийн
                  доромжлол, хүчирхийлэл, заналхийлэлтэй авирыг тэвчихгүй. Үүнд
                  хэрэглэгчийн контент, хэрэглэгчийн нэр болон Kooth платформ
                  дотор болон гадна талд байгаа хэрэглэгчидтэй холбоотой бусад
                  мэдээллийг хуваалцах зэрэг орно. Энэ нь таны данс идэвхгүй
                  болж болзошгүй. Эдгээр нөхцөлд бид цагдаад шилжүүлэх гэх мэт
                  нэмэлт арга хэмжээ авах боломжтой.
                </li>
              </ul>
            </div>
          </div>

          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Өөрийгөө болон бусдыг аюулгүй байлгах
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            <div className="pl-7 pt-3">
              <ul className="list-disc list-outside">
                <li>
                  Та форум дээр эсвэл бичсэн сэтгүүлийн өгүүлэл эсвэл тайлбар
                  дээр өөрийнхөө (эсвэл бусад хүний) жинхэнэ нэр, утасны дугаар,
                  имэйл хаяг эсвэл бусад танигдах мэдээллийг өгч болохгүй.
                </li>
                <li>
                  Та манай Нууцлал & аюулгүй байдал хуудастай танилцсан,
                  ойлгосон & хүлээн зөвшөөрсөн.
                </li>
              </ul>
            </div>
          </div>

          <div className="text-[#102d3f] text-2xl font-bold font-['Inter']">
            Нийтлэл болон татаж авах
          </div>
          <div className="w-full text-justify text-[#102d3f] text-lg font-normal font-['Inter']">
            Qwell дээр таны оруулсан эсвэл сайт руу илгээсэн бүх зүйлийг ажилчид
            шалгаж, таны бичсэн зүйлийг хянах, нийгмийн хил хязгаарыг зөрчөөгүй
            эсэхийг шалгана. <br />
            <br />
            Заримдаа зохицуулагч таны бичсэн зүйлийг нийтлэхийн өмнө устгах
            эсвэл бага зэрэг өөрчлөх боломжтой. Таны бичсэн зүйлийг зохицуулсан
            хүн таны бичсэн зүйлийг нийтлэх боломжгүй бол танд мэдэгдэх болно.{" "}
            <br />
            <br />
            Сайтын баримт бичгийг зөвхөн хувийн, худалдааны бус хэрэглээнд татаж
            авах, ашиглах боломжтой. <br />
            <br />
            Бүх эрх хадгалагдан үлдсэн; Qwell-ийн ямар ч хэсэг, түүний дотор
            мэдээлэл, зураг, зураг, худалдааны тэмдэг & лого бидний урьдчилан
            бичгээр зөвшөөрөлгүйгээр ямар нэгэн хэлбэрээр хуулбарлаж, дахин
            нийтлэж, нийтлэж, цацаж эсвэл үржүүлж болохгүй.
          </div>
        </div>
      </div>
      <Footer />
    </div>
  );
};

export default TermsOfServiceContent;
