import Footer from "@/components/homePage/Footer";
import Niitlel1 from "@/components/Niitlel/Niitlel1";
import Link from "next/link";
import { Button } from "@/components/ui/button";

export const allNiitlel = [
  {
    id: "1",
    title: "Улирал солигдох нь сэтгэл зүйд хэрхэн нөлөөлдөг вэ?",
    img: "/Haniad.png",
    subtitle: `Улирлын өөрчлөлт нь зөвхөн цаг уурын нөхцөлд төдийгүй бидний бие махбодь, сэтгэл зүйд ч шууд нөлөө үзүүлдэг. Агаарын хэм өөрчлөгдөх, өдөр шөнийн хугацаа уртсах, богиносох, байгаль орчны өнгө төрх солигдох нь хүн бүрт харилцан адилгүйгээр нөлөөлдөг. Зарим хүмүүс улирал солигдох үед сэтгэл санааны өөрчлөлт мэдрэхгүй байхад заримд нь энэ өөрчлөлт нь сэтгэл зүйн гүнзгий нөлөөлөлд хүргэж болно. Ялангуяа, улирлын сэтгэл гутрал гэж нэрлэгддэг эмгэг хүртэл бий.`,
    negTitle: `1. Улирлын сэтгэл гутрал буюу Сезональ Афектив Эмгэг (SAD)`,
    negText: `Улирлын сэтгэл гутрал нь ихэвчлэн намар болон өвлийн улиралд илэрдэг бөгөөд хүмүүс сэтгэл санаа нь унаж, идэвхгүй болж, энерги дутагдах, уйтгар гунигт автах шинж тэмдгүүд мэдэрдэг. Өдрийн гэрэл багасах үед хүний бие махбодод нөлөөлдөг серотонин, мелатонин зэрэг дааврын ялгарал буурч, нойрны хэмнэл болон сэтгэл санааны байдал өөрчлөгддөг.`,
    hoyrTitle: `2. Хаврын сэргэлт ба сэтгэл хөөрөл`,
    hoyrText: `Хаврын улирал эхлэхэд уртассан өдрүүд, нэмэгдсэн гэрлийн хэмжээ нь бидний сэтгэл зүйд эерэг нөлөө үзүүлдэг. Нарны гэрэл нэмэгдэхийн хэрээр серотонины түвшин өсч, хүмүүс илүү идэвхтэй, аз жаргалтай болдог. Хавар болон зун зарим хүмүүсийн энерги ихэсч, олон төрлийн үйл ажиллагаанд оролцох хүсэлтэй болдог бол зарим хүмүүсийн хувьд энэ өөрчлөлт нь сэтгэл хөөрөл (mania)-д хүргэж болзошгүй. Энэ нь ялангуяа сэтгэл зүйн эмгэгтэй хүмүүст их ажиглагддаг.`,
    guravTitle: `3. Бие махбодын хариу урвал`,
    guravText: `Улирлын өөрчлөлт нь бидний бие махбодын хэмнэлд ч нөлөөлдөг. Нарны гэрэлтэй холбоотойгоор хүний нойрны хэмнэл, биеийн температур өөрчлөгдөж, биологийн цаг буюу циркадийн ритм дасан зохицоход хугацаа ордог. Энэ өөрчлөлт нь зарим хүмүүсийг ядарч сульдах, нойргүйдэх, анхаарал төвлөрөх чадвар буурахад хүргэдэг. Намар, өвөлд хүмүүс илүү хүнд хувцаслах шаардлагатай болдог нь хөдөлгөөний идэвхийг бууруулж, сэтгэл санааг дарамтлах хүчин зүйл болдог.`,
    duruvTitle: `4. Улиралын өөрчлөлтийн үеийн сэтгэл зүйн зөвлөгөө`,
    duruvText: `Сэтгэл санааны тогтворгүй байдал, ялангуяа намар, өвлийн улиралд гарах өөрчлөлтийг бууруулахын тулд дараах зөвлөгөөг хэрэгжүүлж болно:
Гэрэлтэй орчин бүрдүүлэх: Өдрийн гэрэл дутагдах үед гэрлийн эмчилгээ буюу light therapy ашиглах нь сэтгэл санааг тогтвортой байлгахад тустай.
Дасгал хөдөлгөөн: Хөдөлгөөн хийх нь стрессийг бууруулж, серотонины түвшинг нэмэгдүүлдэг. Ялангуяа гадаа алхах, дасгал хийх нь сэтгэл санааг өөдрөг байлгахад тусална.
Хооллолт: Жимс, ногоо зэрэг шим тэжээлтэй хүнсийг хэрэглэх нь энерги нэмэгдүүлж, сэтгэл санааг тогтворжуулахад чухал үүрэгтэй.
Нойрны хэмнэл: Тогтмол цагт унтаж, сэрэх нь биологийн цагийг хэвийн байлгаж, улирлын өөрчлөлтийн сөрөг нөлөөг бууруулдаг.
Мэргэжлийн тусламж: Хэрэв сэтгэл гутрал, улирлын нөлөө хэтэрхий хүчтэй мэдрэгдэж байвал сэтгэл зүйчид хандах нь зүйтэй.`,
    tavTitle: `5. Сэтгэл зүйгээ анхаарах нь`,
    tavText: `Хэдийгээр улирлын өөрчлөлтөөс зайлсхийж чадахгүй ч бид бие, сэтгэл зүйдээ илүү их анхаарал тавьж, сөрөг нөлөөг багасгах боломжтой. Хамгийн гол нь өөрийн бие организмд гарч буй өөрчлөлтүүдийг ажиглаж, зохих арга хэмжээг авах нь эрүүл, аз жаргалтай байх үндэс суурь болно.`,
  },
  {
    id: "2",
    title: "Гэр бүл салалтын дараа сэтгэл зүйдээ хэрхэн анхаарах вэ?",
    img: "/Salalt.png",
    subtitle: `Гэр бүл салалт бол бидний амьдралд гардаг, заримдаа зайлсхийх боломжгүй өөрчлөлт бөгөөд өөрийн хичээж байсан зүйлийг алдсанаар таамаглах аргагүй мэдрэмжүүд үүсдэг.
              Тиймээс эхний алхам бол өөртөө байгаа сэтгэл санааны өөрчлөлтүүдийг хүлээн зөвшөөрч, тэдгээр мэдрэмжүүдээс зугтаахгүй байх юм. Гутрал, уйтгар, ганцаардал зэрэг мэдрэмжүүд нь таны сэтгэл зүйд хэрхэн нөлөөлж байгааг ухамсарлаж, өөрийгөө буруутгалгүйгээр тэдгээр мэдрэмжийг бүрэн мэдрэх боломж олгоорой.`,
    negTitle: `1. Эрүүл амьдралын хэв маягийг бий болгох`,
    negText: `Дасгал хөдөлгөөн: Биеийн хөдөлгөөн хийх нь сэтгэл санааг тайвшруулж, серотонин болон эндорфин гэх аз жаргалын даавруудыг ялгаруулдаг тул стресс бууруулж, эерэг энерги авчирна.
              Эрүүл хооллолт: Аминдэмээр баялаг, эрүүл хүнс хэрэглэх нь таны сэтгэл зүйг тэнцвэртэй байлгах үүднээс чухал.
              Тогтмол нойрны хэмнэл: Нойр дутуу явах нь сэтгэл санаанд сөргөөр нөлөөлдөг тул тогтмол цагт унтаж амрахыг хичээгээрэй. `,
    hoyrTitle: `2. Найз нөхөд, гэр бүлийнхэндээ тулгуурлах`,
    hoyrText: `Салалтын дараах ганцаардлын мэдрэмж нь хүчтэй байдаг тул өөрийгөө тусгаарлахгүй байх хэрэгтэй. Та ойр дотнын хүмүүстэйгээ цагийг өнгөрөөж, тэднээс тусламж дэмжлэг аваарай. Гэр бүл болон найз нөхөдтэйгөө ярилцах нь таны мэдэрч буй сэтгэл санааны дарамтыг багасгаж, өөрийн мэдрэмжүүдээ ойлгоход тусална.`,
    guravTitle: `3. Өөрийгөө дахин нээх`,
    guravText: `Салалт нь ихэвчлэн нэгэн шинэ боломжийг бий болгодог. Өөрийгөө илүү сайн ойлгох, өөрийгөө хөгжүүлэх, шинэ зүйл сурах боломжийг ашиглах нь таны амьдралд эерэг өөрчлөлт авчрах болно. Дуртай хоббигоо олж, шинэ сонирхолтой зүйлсэд хичээллэж, бие даан хөгжихийг зорих нь сэтгэл санааг тань сэргээнэ.`,
    duruvTitle: `4. Мэргэжлийн тусламж авах`,
    duruvText: `Гэр бүл салалт нь гүнзгий стресс, депресс үүсгэх нь элбэг байдаг тул хэрэв та өөрөө даван туулж чадахгүй гэж бодож байвал мэргэжлийн сэтгэл зүйчид хандаж зөвлөгөө авах хэрэгтэй. Сэтгэл зүйчид таныг мэдрэмжээ зөв илэрхийлэх, өөртөө итгэх итгэлээ сэргээхэд тусалж, өөрийгөө илүү сайн ойлгоход дэмжлэг үзүүлдэг.`,
    tavTitle: `5. Ирээдүйд эерэгээр хандах хандлага бий болгох`,
    tavText: `Салалтын дараах сэтгэл зүйн хүндрэлүүдийг даван туулахын тулд ирээдүйд эерэгээр хандах нь чухал. Уйтгар гуниг, харамсал нь өнгөрснийг эргэж харах үед л хүчтэй мэдрэгддэг тул ирээдүйдээ анхаарлаа хандуулж, шинэ зорилго тавин урагшлах нь танд шинэ сэдэл өгнө. Амьдралынхаа төлөвлөгөөгөөр шинэ үйл ажиллагаанууд, мөрөөдөл, зорилгод төвлөрөхийг хичээгээрэй.
              Гэр бүл салалт бол амаргүй бөгөөд түүнийг дагаад сэтгэл зүйд өөрчлөлтүүд бий болдог. Гэсэн ч эдгээр мэдрэмжүүдийг зөв зохицуулж, өөрийгөө илүү сайн ойлгох, хүчтэй болох боломж болгон ашиглах хэрэгтэй. Сэтгэл санаагаа сэргээх, өөртөө анхаарал тавих нь амьдралын дараагийн алхмуудад эерэг өөрчлөлтийг бий болгох үндэс суурь болох болно.`,
  },
  {
    id: "3",
    title: "Цас бидний сэтгэл зүйд хэрхэн нөлөөлдөг вэ?",
    img: "/Uvul.png",
    subtitle: `Цас болон өвлийн улирал бидний сэтгэл зүйд олон янзаар нөлөөлж болно. Ерөнхийдөө, байгалийн хүчин зүйлс бидний сэтгэл хөдлөл, сэтгэцийн эрүүл мэндэд нөлөөлөх нь судлагдсан бөгөөд цас ихтэй, хүйтэн улиралд хүмүүсийн сэтгэл санаа өөрчлөгдөх тохиолдол элбэг байдаг. Энэ нь дараах байдлаар илрэх боломжтой:`,
    negTitle: `1. Сэтгэл гутрал ба улирлын нөлөөт сэтгэл гутрал (SAD):`,
    negText: `Цас ордог өвлийн улиралд нарны гэрэл багасаж, өдрийн урт богиносох нь зарим хүмүүст сэтгэл гутрал үүсгэж болох юм. Нарны гэрлийн дутагдалтай үед хүний биед серотонин, мелатонин гэх мэт сэтгэл санаанд нөлөөлдөг химийн бодисын түвшин буурдаг. Энэ нь энергигүй байдал, сэтгэлээр унах зэрэг сэтгэлийн зовиурыг нэмэгдүүлдэг.`,
    hoyrTitle: `2. Амралт ба амар амгалангийн мэдрэмж:`,
    hoyrText: `Цас бол зарим хүмүүст тайвшрал, амар амгалангийн мэдрэмж төрүүлдэг байгалийн үзэгдэл юм. Ялангуяа цасны орсны дараах нам гүм орчин хүмүүсийн сэтгэл зүйд эерэг нөлөө үзүүлж, стресс бууруулах боломжтой.`,
    guravTitle: `3. Бүтээлч байдал болон романтик сэтгэл хөдлөл: `,
    guravText: `Цастай өвлийн улиралд хүмүүс байгаль орчиндоо урам зориг авч, сэтгэл санааны хувьд гүнзгийрэх, романтик сэтгэл төрөх, эсвэл бүтээлч байдлаа хөгжүүлэх нь түгээмэл байдаг.`,
    duruvTitle: `4. Ганцаардал ба тусгаарлалт: `,
    duruvText: `Өвлийн хүйтэн, цастай өдрүүд нь зарим хүмүүст тусгаарлагдсан мэт мэдрэмж төрүүлдэг. Гадаа гарахад хэцүү, цаг агаарын байдлаас шалтгаалж хүмүүс гэртээ үлдэх нь ихэсдэг бөгөөд энэ нь ганцаардал үүсгэж, сэтгэл санааг дарамттай болгодог.`,
    tavTitle: `Хүүхэд насны дурсамж сэргээх: `,
    tavText: `Цас орж байгааг харах нь хүүхэд насны хөгжилтэй дурсамжуудыг сэргээн сануулж, сэтгэл санааг өөдрөг болгох нөлөөтэй байж болно.`,
  },
  {
    id: "4",
    title: "Сургуульд орсон хүүхдийнхээ сэтгэл зүйд хэрхэн анхаарах вэ?",
    img: "/image4.jpg",
    subtitle: `Сургуульд шинээр орсон хүүхдүүд янз бүрийн сэтгэл зүйн асуудлуудтай тулгардаг. Эдгээр нь ихэвчлэн нийгэмших, суралцах орчинд дасах, бие даах чадвартай болох зэрэгтэй холбоотой байдаг.`,
    negTitle: `1. Анхааралтай сонсох`,
    negText: `Хүүхдийнхээ яриаг анхааралтай сонсож, түүний юу мэдэрч, ямар асуудалтай тулгарч байгааг ойлгохыг хичээх хэрэгтэй. Хүүхдүүд ихэнхдээ сэтгэл санааны байдлаа шууд илэрхийлэхээс илүү далд байдлаар илэрхийлдэг тул илүү нарийн мэдрэмжүүдийг ойлгохыг хичээгээрэй.`,
    hoyrTitle: `2. Дэмжлэг үзүүлэх`,
    hoyrText: `Хүүхдэдээ дэмжлэг үзүүлэх, тэднийг ойлгож байгаагаа мэдрүүлэх нь маш чухал. Хүүхэд аливаа асуудалд орвол түүнийг шийдвэрлэхэд нь хамтран оролцох, зөвлөгөө өгөх нь сэтгэл санааны хувьд тайвшрахад тусална.`,
    guravTitle: `3. Өөртөө итгэлтэй байхад нь туслах`,
    guravText: `Хүүхдийн амжилт, ахиц дэвшлийг сайшааж, өөртөө итгэх итгэлийг нь нэмэгдүүлэх хэрэгтэй. Хүүхэд бэрхшээлтэй тулгарч байгаа үед нь чадах зүйлээ хийж буйг нь дэмжих нь чухал.`,
    duruvTitle: `4. Өдөр тутмын хэв маягийг тогтоох`,
    duruvText: `Тогтсон өдөр тутмын хэв маяг, хуваарь нь хүүхдийг тайван байлгаж, зохион байгуулалттай болоход тусалдаг. Хоолны цаг, унтах цаг зэрэг тогтмол хуваарь нь хүүхдийн бие болон сэтгэл зүйд эерэг нөлөөтэй.`,
    tavTitle: `5. Мэргэжлийн тусламж авах`,
    tavText: `Хэрэв хүүхдийн сэтгэл зүйн асуудал нь хүнд байвал мэргэжлийн сэтгэл зүйч, зөвлөхтэй зөвлөлдөж, тусламж авах нь зүйтэй.`,
  },
  {
    id: "5",
    title: "Ганцаардал уу? эсвэл Сэтгэл гутрал уу?",
    img: "/image5.png",
    subtitle: `Сэтгэл гутрал (депресс) болон ганцаардал нь бие биетэйгээ уялдаа холбоотой байж болох ч тус тусдаа ялгаатай сэтгэл зүйн байдал юм. Эдгээрийг ялгаж мэдэхийн тулд доорх шинж тэмдгүүдийг анхаарах хэрэгтэй.`,
    negTitle: `Ганцаардал ба Сэтгэл гутралын хоорондын хамаарал`,
    negText: `Ганцаардал удаан хугацаагаар үргэлжилбэл сэтгэл гутралд хүргэж болно. Ганцаардлаас үүдэн хүмүүс өөрийгөө үнэ цэнэгүй мэт мэдрэх, нийгмээс тасрах магадлалтай байдаг. Гэсэн хэдий ч, сэтгэл гутрал нь ганцаардлаас үүсэхээс гадна өөр олон шалтгаануудаас ч үүсч болно.`,
    hoyrTitle: `Шинж тэмдгийн үргэлжлэх хугацаа: `,
    hoyrText: ` Ганцаардал богино хугацаанд илэрч, нөхцөл байдал сайжирвал арилж болно. Харин сэтгэл гутрал нь удаан хугацааны туршид (хоёроос дээш долоо хоног) үргэлжилдэг.`,
    guravTitle: `Гүнзгий нөлөө:`,
    guravText: ` Сэтгэл гутрал нь амьдралын бүх талд нөлөөлж, ажил, сургууль, харилцаанд ноцтой хүндрэл учруулдаг бол ганцаардал нь голдуу нийгмийн харилцаанд төвлөрдөг.`,
    duruvTitle: `Өөртөө хандах хандлага:`,
    duruvText: `Ганцаардал нь нийгмийн харилцааны хэрэгцээг илэрхийлэх бол, сэтгэл гутрал нь өөртөө итгэх итгэлгүй байдал, өөрийгөө буруутгах мэдрэмжээр илэрдэг.`,
    tavTitle: `Юу хийх хэрэгтэй вэ?`,
    tavText: `Ганцаардал бол нийгмийн харилцаагаа нэмэгдүүлэх, шинэ хүмүүстэй танилцах, найз нөхөдтэйгөө илүү их цагийг өнгөрөөхийг хичээх хэрэгтэй.  Хэрэв та сэтгэл гутралтай гэж үзэж байгаа бол мэргэжлийн тусламж авах нь зүйтэй. Сэтгэл зүйчид хандах, зөвлөгөө авах нь үр дүнтэй.`,
  },
  {
    id: "6",
    title: "Хөвгүүд мэдрэмжээ илэрхийлэх эрхтэй",
    img: "/image6.jpg",
    subtitle: `Та “Хөвгүүд уйлдаггүй юм”, “Эр хүн байж охин шиг” гэх мэт үгнүүдийг хаа нэгтээ сонсож байсан уу? Ийм маягаар бид хүүхэддээ уйлах, сөрөг сэтгэл хөдлөлөө илэрхийлэх боломжийг нь бүрэн олгодоггүй. Эцэг эхчүүд эрэгтэй хүүхэд уурлаж болно. Харин уйлж болохгүй гэж үздэгийг судалгаагаар тогтоожээ. Ийм хандлага нь хөвгүүдийг өөрийгөө ойлгохгүй байх, сөрөг сэтгэл хөдлөлөө түрэмгий байдлаар эсвэл огт илэрхийлэхгүй байхад хүргэдэг байна.`,
    negTitle: `Уйлж буй бяцхан хөвгүүдийг шоолохын оронд аргадсан бол олон эрчүүд өөрсдийн сэтгэл хөдлөлийг ойлгож, уур бухимдлаар илэрхийлэх гэж хүчлэхгүй байх байсан.`,
    negText: ``,
    hoyrTitle: `Ярилцах`,
    hoyrText: `Аав ээжүүд хүүтэйгээ өөрийн болон түүний сэтгэл хөдлөлийн талаар ярилцах хэрэгтэй. Өөрт төрж буй мэдрэмжээ хуваалцах нь ямар чухал гэдгийг ойлгуулаарай. Хөвгүүд үе тэнгийнхнийхээ дунд өөрийн мэдрэмжээ илэрхийлснийхээ хариуд шоглуулах тохиолдол байдаг. Иймд ядаж гэр бүлийнхээ орчинд өөрийн мэдрэмжээ нуулгүй ил гаргахад нь туслаарай. “Хөвгүүд уйлдаггүй. Эрэгтэй юм байж битгий уйл. Чамайг уйлвал хүмүүс шоолно шүү.” гэх мэт үгсийг хүүдээ хэлэхээс татгалзаарай. Өөрийн мэдрэмжээ нуух биш түүнийгээ ойлгож, зөвөөр илэрхийлэх нь супер хүч гэдгийг ойлгуулаарай.`,
    guravTitle: `Сэтгэл хөдлөл, мэдрэмжтэй танилцуулах`,
    guravText: `Хүүхэд сэтгэл хөдлөл, мэдрэмжээ ойлгохын тулд тэднийг ялгаж мэддэг байх хэрэгтэй. Тодорхой нөхцөл байдлыг жишээ татаж, энэ үед түүнд ямар мэдрэмж төрдөг талаар ярилцаарай. Мэдрэмжинд хүйс байдаггүй бөгөөд хүн бүр чамтай адилхан мэдэрдэг, энэ нь ичмээр зүйл биш гэдгийг хэлээрэй.`,
    duruvTitle: `Ном унших`,
    duruvText: `Сэтгэл хөдлөл, мэдрэмжийн талаарх номыг хамтдаа уншиж, гол дүрийн баатрын оронд байсан бол яах байсан талаар ярилцаарай. Энэ нь нэг талаас хүүхдийнхээ эмпатиг (бусдын оронд өөрийгөө тавих, бусдыг ойлгох чадвар) сайжруулахад тусална.`,
    tavTitle: `Мэдрэмжээ мэдрэхэд нь тусал`,
    tavText: `Сэтгэл хөдлөлөө бүрэн дүүрэн мэдрэх боломжийг олгоорой. Бид хүүхэд маань унаад хөлөө шалбалахад юун түрүүнд уйлахыг нь болиулахыг хичээдэг. Үүний оронд “Өвдөж байна уу? Ээж нь чамайг ойлгож байна. Дараагийн удаа хоёулаа хамтдаа болгоомжтой тоглоё. Тайвширтлаа уйлчих.” гэж хэлээрэй.`,
  },
  {
    id: "7",
    title: "Хайрын код",
    img: "/image7.jpeg",
    subtitle: `Бидний хэн байх нь ухамсарт сонголт, хичээл зүтгэлээс хамаардаг ч бидний бага нас өнөөдрийн БИ -тэй салшгүй холбоотой. Ямар нөхцөлд би хэрхэн хариу үйлдэл үзүүлдэг, ямар үед хэрхэн өөрийгөө илэрхийлдэг зэрэг нь бидний ухаан орохдоо, хүрээлэн буй орчноо хэрхэн мэдэрч, дасан зохицох шаардлагатай байсантай холбоотойгоос гадна хосын харилцаанд биеэ хэрхэн авч явдаг болоход хүртэл нөлөөлдөг гэдгийг гэр бүл, хосын судлаачид болох Милан, Кэй Иэркович тодорхойлжээ. Бага нас болгон тухтай, хайр энэрлээр дүүрэн байдаггүй. Гэлээ гээд та хайр мэдэхгүй эсвэл хайрлаж чадахгүй гэсэн үг огт биш шүү.`,
    negTitle: `1. The Pleaser – Бялдууч`,
    negText: `Хэт шүүмжлэмтгий, ууртай, хатуу ширүүн эцэг эх, асран хамгаалагчтай гэрт тэд өсдөг. Хүүхэд л болсон хойно хамт байгаа том хүнээ уурлуулчихгүйн тулд өөрийн байж чадах хамгийн сайнаараа байна. Дуулгавартай, томоотой, үгэнд ордог. Энэ хүүхэд эцэг эх, асран хамгаалагчаасаа халамж тайтгарал авдаггүй, харин эсрэгээрээ өөрийн цаг зав, эрч хүчээ томчуудыг тайтгаруулахад зарцуулна.  Энэ төрлийн хүмүүс маргаан, үл ойлголцолд хэт тухгүй мэдрэмж авдаг болохоор маргаанаас зугтах, хурдан бууж өгөх, уучлалт гуйх хандлагатай байдаг. Тэд зөрчил, маргаанд дургүй учир бусдад үгүй гэж бараг л хэлэхгүй, санал зөрөлдөхгүйн тулд өөрийн жинхэнэ бодол мэдрэмжийг нууна, худал үг ч хэлнэ. Насанд хүрэх явцдаа тэд ойр орчмын хүмүүсийнхээ сэтгэл санаа, зан аашийг хэнээс ч сайн уншиж, бүгдийг аз жаргалтай, хэрүүл маргаангүй байлгахын тулд өөрийн хэрэгцээ шаардлагыг хүртэл мартана. Хэрвээ тэд хэн нэгний итгэлийг алдсан эсвэл хангалтгүй байгаа мэт санагдвал тэд сэтгэлээр унаж, магадгүй харилцаагаа дуусгавар болгох хандлагатай.  Жишээ нь Бат. Бат сургуулийнхаа шилдэг сурагч, нэр хүндтэй их сургуульд суралцан төгссөн. Түүн шиг хүн амьдралынхаа утга учрыг олчихсон байхдаа л гэмээр харагдана. Гаднаасаа бусдад их таатай харагдах ч дотроо тийм ч тухтай биш. Асуудал тулгарахад хаана асуудал үүсээд байгааг ил тод ярилцахгүй, гарц гаргалгаа ярихгүй, тайвширтлаа таг алга болно. Найз нөхөд, гэр бүлийнхний бодол түүнд маш чухал.. Магадгүй нэг сэдэв дээр Батаа-гийн хувийн бодлыг нь асуувал түүнд хэлэх үг олдохгүй байх.  Бусдын хэрэгцээ шаардлагад тулгуурлан өөрийгөө өөрчилж, хичээнэ. Хэрвээ та Бат-аас өөрийгөө олж харсан бол тогтвортой, эрүүл харилцааг үүсгэхийн тулд бусдын хүлээлтэд өөрийгөө тааруулах гэж хичээхээс илүү өөрийн бодол мэдрэмжээ сонсож, түүнийгээ хайртай дотнын хүмүүстэйгээ нээлттэй ярилцахыг хичээгээрэй.`,
    hoyrTitle: `2. The Victim – Хохирогч`,
    hoyrText: `Дуулиан шуугиантай гэрт хохирогч нар хүмүүжих нь элбэг. Өөр дээрээ аль болох бага анхаарал авах нь аминд өлзийтэй тул хохирогч нар их уян хатан байж нөхцөл байдалдаа дасан зохицно. Ууртай, гар хүрдэг эцэг эх, асран хамгаалагчтайгаа зохицохын тулд тэд дуугаа хурааж, нуугдаж сурна. Бодит байдал хэтэрхий хатуу тул тэд өөрийн төсөөллийн ертөнцөө үүсгэдэг.  Хохирогч нар өөртөө итгэлгүй, сэтгэл гутрал эсвэл түгшүүртэй байх нь түгээмэл. Амьдралын ханиа сонгохдоо бага насандаа өөрийн дассан, тухтай биш ч дотно мэдрэмжийг өгөх зан ааштай хүнийг сонгох нь элбэг. Урсгалаараа урсаж, уян хатан байх нь тэдний хувьд амьд үлдэх ганц арга зам. Тэдний хувьд маргаан зөрчилдөөнтэй нөхцөл байдал тухгүй биш, харин ч болох зүйл болж буй мэдрэмжийг авна. Харин зөрчилдөөн хооронд үүсэх хэсэг зуурын тайван байдал тэднийг тавгүй туулна   Энэ төрлийн хүмүүс тогтвортой, урт хугацааны эрүүл харилцаанд орохын тулд эхлээд өөрийгөө хайрлаж сурах хэрэгтэй. Хэн хүссэн хүнд өөрийгөө гишгүүлэлгүй, шаардлагатай нөхцөл байдалд өөрийн бодол мэдрэмжийг чухалчилж, өөрийнхөө төлөө дуугарах нь өөрийгөө хайрлах хайрын нэг хэлбэр юм шүү. `,
    guravTitle: `3.The Controller – Хянагч`,
    guravText: `Өсөж хүмүүжиж буй орчин, гэр бүлийн хүмүүсээсээ тогтвортой, аюулгүй мэдрэмжийг авч чадаагүй хүүхэд өөрөө өөрийгөө хатуужуулж, өөрийгөө асарч сурдаг. Бага насандаа мэдэрсэн сул дорой, хүчгүй мэдрэмжийг ахиж хэзээ ч мэдрэхгүй гэх бодолдоо тэд бүх зүйлийг өөрийн хяналт дор байлгахыг хүснэ. Бүх зүйл хяналтад байгаа цагт тэд хэзээ ч айхгүй, сул дорой мэдрэмж авахгүй, ичихгүй.  Уур нь түүний хувьд бүх зүйлийг хяналтдаа байлгах арга хэрэгсэл болно. Өөрийн тав тухтай орчноос цааш гарахыг хүсэхгүй. Хянагчид асуудлыг гартаа авч, өөрийн аргаар шийдвэрлэнэ. Нөхцөл байдал хяналтаас гарахад тэд хяналтыг эргүүлэн гартаа авахын тулд уурлана.  Энэ төрлийн хүмүүс урт хугацааны эрүүл бас тогтвортой харилцаа үүсгэхийн тулд тэд бусдад итгэж сурах хэрэгтэй. Зарим нэг зүйлийг тоолгүй өнгөрөөж сурахаас гадна ямар нөхцөлд өөрийн уурлаад байгааг анзаарах, үнэхээр уурлах асуудал мөн үү эсвэл хяналтаа алдаад сул дорой болох гээд байгаа юм шиг санагдсан болохоор уурлаж байна уу гэдгээ ялгаж салгаарай. `,
    duruvTitle: `4.The Vacillator – Эргэлзэгч `,
    duruvText: `Ямар үед хүн эргэлздэг вэ?  Яг тийм.. Тодорхойгүй нөхцөл байдал хүнийг эргэлзүүлдэг. Эцэг эх, асран хамгаалагч нар нь нэг бол хайраар булаад, нэг бол ердөөсөө тоохгүй, тогтворгүй барьцгүй, тодорхойгүй байсан бол хүн эргэлзэгч болох нь түгээмэл байх нь. Ээж аав, асран хамгаалагчийнх нь хувьд тэдний хэрэгцээ хамгийн чухал, хамгийн үнэ цэнэтэй зүйл биш гэдгийг хүүхэд насандаа ойлгоно. Эцэг эх, халамжлагчаасаа авах анхаарал, халамж нь тийм ч тогтвортой биш байх нь энэ төрлийн хүмүүсийг хайртай дотнын хүмүүстээ хаягдахаас айх хүчтэй айдсыг үүсгэдэг.  Тэд нас биед хүрэхдээ бага насандаа авч чадаагүй тогтвортой, найдвартай хайрыг олохыг хүсдэг. Шинэ харилцаанд орохдоо тэд туйлын сайхныг төсөөлнө. Хүлээлтээ хэт өндөр тавьж, үүлэн дунд нисэж байгаад бага зэргийн сэтгэлд хүрэхгүй, хүлээлтээс доогуур зүйл тохиолдоход тэдний харилцаандаа итгэх итгэл нь тэр чигтээ ганхана. Эргэлзэгч нар өөрчлөлтөд хэврэг бас эмзэг. Хос нь түүнтэй харилцах харилцаанд гарсан ялихгүй өөрчлөлтийг ч анзаарна. Энэ төрлийн хүмүүс урт хугацааны тогтвортой,  эрүүл харилцааг үүсгэхийн тулд бусдыг таньж мэдэхдээ хугацаа зарцуулж сурах хэрэгтэй. Танилцаад удаагүй байж хамгийн сайн сайхныг төсөөлж хүлээлт үүсгэчхээд, тэр хүлээлтээрээ өөрийгөө шаналгахгүй байхыг хичээх хэрэгтэй. `,
    tavTitle: `5.The Avoider – Зугтагч`,
    tavText: `Хайр халамж багатай, биеэ даасан байдлыг эрхэмлэдэг гэрт зугтагч нар хүмүүжих нь элбэг. Бага наснаасаа өөрийн мэдрэмж хүслийг хойш нь тавин байж биеэ даан, өөрөө өөрийгөө арчилж сурдаг. Тэд өөрийн хувийн орон зайдаа хамгийн тухтай. Сэтгэл хөдлөл, мэдрэмжээ сонсож, зүрхээ чухалчилчхаас илүүтэй логик гаргалгаа, тархиндаа найддаг. Тэд сэтгэл хөдлөл ихтэй хүний хажууд байхдаа нэг л тухгүй. Энэ төрлийн хүмүүс эрүүл, тогтвортой, урт хугацааны харилцаа үүсгэхийн тулд өөрийн мэдрэмжээ ойлгож, түүнийгээ нээлттэй илэрхийлж сурах хэрэгтэй.  Энэхүү нийтлэлээрээ хүмүүсийг ямар нэг ангилалд хамаатуулан хайрцаглах гэсэнгүй. Харин бага нас хүний романтик харилцаанд хэрхэн нөлөөлөх боломжтой гэдгийг, бас өөрийгөө хэрхэн хайрладаг, хайрлагддаг гэдгээ ойлгоход бага ч гэсэн чиглүүлэг болно байх гэдэг үүднээс бичлээ. Хайр, хосын харилцаа нь яг л хүн шигээ хувьсан өөрчлөгдсөөр байдаг. Бага нас болгон тухтай, хайр энэрлээр дүүрэн байдаггүй. Гэлээ гээд та хайр мэдэхгүй эсвэл хайрлаж чадахгүй гэсэн үг огт биш шүү. Германы алдарт Эрик Фромм сэтгэл судлаачын өгүүлснээр хайрлах гэдэг үйлдэл нь хүний амьдралын явцад суралцдаг чадвар. Өөрийн болон хосынхоо хайрын загварыг тодорхойлсноор нэг нэгнээ илүү ойлгох, ойлголцох боломж нээгдэхээс гадна бидний хайрлах чадвараа сайжруулахын тулд олох хэрэгтэй эхлэлийн цэг байх болно гэж ахин давтаад нийтлэлээ дуусгая. `,
  },
  {
    id: "8",
    title: "Сэтгэл зүйн зөвлөгөө VS Найзын зөвлөгөө",
    img: "/image8.jpg",
    subtitle: `Таныг сонсоод суух найз байгаа учраас сэтгэл судлаачид хандах шаардлагагүй гэж хүмүүс бодох нь түгээмэл. Гэхдээ сэтгэл судлаачтай ярилцах нь хайртай дотын хүмүүстэйгээ сэтгэлээ уудлан ярилцахаас өөр гэдгийг энэхүү нийтлэлээрээ тодруулах гэж зорилоо.  Дотнын хүмүүстэйгээ ярилцах нь магадгүй үнэгүй бас тухайн үедээ тайвшраад өнгөрдөг байж болох юм. Гэхдээ мэргэжлийн сэтгэл зүйчтэй ярилцах нь танд цаашид бие даан амьдралын чанараа сайжруулахад хэрэглэгдэх танин мэдэхүйн болон сэтгэл хөдлөлийн чадваруудыг өгдөг.  Сэтгэл зүйн зөвлөгөө гэх үйлчилгээнд ямар хүлээлт тавихаа мэдэхгүй байх үед сэтгэл зүйчид хандах нь найзтайгаа ярилцахаас нэг их ялгаагүй гэж таамаглах амархан. Гаднаас нь харахад аль аль нь л хоёр хүн хоорондоо ярилцаж, сонсож, зөвлөж байгаа харагддаг нь үнэн.`,
    negTitle: `Хүмүүс яагаад сэтгэл зүйн зөвлөгөө авах, найзтайгаа ярилцах хоёр ялгаагүй гэж боддог вэ?`,
    negText: ` `,
    hoyrTitle: `Сэтгэл зүйн зөвлөгөө нь ярихаас цаашгүй`,
    hoyrText: `Зөвхөн харилцан ярилцах гэж хэн нэгэнд төлбөр төлнө гэдэг бол мөнгөний гарз. Гэхдээ сэтгэл зүйн зөвлөгөө өгөх үйлчилгээний зөвхөн ил харагдах хэсэг, мөсөн уулын орой нь л харилцан яриа юм. Сэтгэл зүйн зөвлөгөөний урт хугацааны үнэ цэнээс дурдвал:
• Мэдрэмжээ ойлгох, мэдрэх, илэрхийлэх чадварт суралцах
• Амьдралын чанарт нь сөргөөр нөлөөлдөг сөрөг бодол, итгэл үнэмшлээ сорих
• Нөхцөл байдал болон хүмүүсийг харах, ойлгох шинэ өнцөг,
• Харилцааг сайжруулах
• Өөрийн эерэг сөрөг бодол, бодлын зам, үйлдлийг таньж мэдэх
• Таны өнгөрсөн амьдрал одоод хэрхэн нөлөөлж байгааг ойлгох
• Өөрийн мэдрэмж, бодлоо удирдах, ойлгох арга техникт суралцах
• Өөрийгөө ойлгох, таньж мэдэх
• Сэтгэл зүйн тулгамдсан асуудал нь цаашид улам даамжирч, сэтгэцэд нөлөөлөхөөс урьдчилан сэргийлнэ
• Blindspot-г сэтгэл зүйч нөхөж өгдөг`,
    guravTitle: `Сэтгэл зүйч таныг сорихгүй гэж боддог`,
    guravText: `Хүмүүс сэтгэл зүйч таны найзын өгдөг шиг зөвлөгөө өгч, таны сонсохыг хүссэн зүйлийг хэлж, санал нийлсэн өнгө аясаар ярилцана гэж төсөөлнө. Гэхдээ сэтгэл зүйч нар таны бодлыг сорьж байдаг. Ингэснээр та өөрийн амьдралын чанарыг сайжруулах шинэ арга замыг эрэлхийлж, туршиж эхлэх нөхцөл бүрдэнэ. Зарим үед сэтгэл зүйн зөвлөгөө танд тухгүй ч санагдаж магадгүй. Гэхдээ сөрөг бодол, зуршлаа таньж харах зам тийм ч дардан биш гэдгийг хүлээн зөвшөөрөх хэрэгтэй. Мэргэжлийн хүнээс дөлөх зарим нэг шалтгаан нь өөрчлөлтөөс зугтах хандлага байх нь ч түгээмэл. Шаардлагатай тохиолдолд мэргэжилтэн таны амьдралыг харах өнцгөөс өөр хувилбаруудыг санал болгож, таны итгэл үнэмшлийг сорих бол найз нөхөд таны талд бат зогсож тантай ижил үзэл бодолтой байх нь элбэг.`,
    duruvTitle: `Тэгвэл яг ямар ялгаатай вэ? Сэтгэл зүйч таны хувийн мэдээлэл болон нууцыг чандлан хадгалах үүрэгтэй`,
    duruvText: `Таны мэдээлэл, түүхийг сэтгэл зүйч өндөр нууцлалаар хадгалах ёс зүйн дүрэмтэй байдаг тул та дотын хүмүүстээ хэлэх боломжгүй, дотроо хадгалдаг бодол мэдрэмжээ санаа зовохгүйгээр сэтгэл зүйчтэйгээ хуваалцах боломжтой. Найздаа хэлсэн яриа, бодол мэдрэмж чинь цаашаа таны мэддэг өөр хүмүүст хүрэх эрсдэл үргэлж байдаг.`,
    tavTitle: `Сэтгэл зүйч таныг шүүмжлэхгүй`,
    tavText: `Олон жил суралцахдаа сэтгэл зүйч нар үйлчлүүлэгчийнхээ асуудал, бодол мэдрэмжийг өөрийн хувийн бодол мэдрэмжээс тусгаарлаж, шүүмжлэлгүйгээр сонсож таны асуудал, мэдрэмж дээр төвлөрөх чадварт суралцдаг. Ийм учраас үйлчлүүлэгч нар сэтгэл зүйн зөвлөгөө өгөх өрөөнд илүү нээлттэй, биеэ барихгүй чөлөөтэй байдаг. Сэтгэл зүйчийн ажил таныг шүүмжилж, юу зөв юу буруу болохыг заах биш гэдгийг ч үйлчлүүлэгч нар сайн мэддэг.`,
  },
  {
    id: "9",
    title: "Хүүхдэдээ хайраа мэдрүүлэх үгс",
    img: "/image9.jpg",
    subtitle: `Та хүүхдэдээ хэр их сайхан үгсийг хэлдэг вэ? “Мундаг шүү”, “Сайн байна” гээд л таны магтаалын үгс дуусчихдаг бол энэ нийтлэлээрээ хүүхдэдээ өдөр болгон хэлж хайраа мэдрүүлж байх амьдралдаа хэвшүүлэх хэрэгтэй үгсийг хүргэж байна. Хүүхдүүд эцэг эхээсээ хайрын илэрхийллийг үйлдлээс нь мэдэрч, үгээр нь сонсохыг хүсдэг юм шүү. Зөвхөн хүүхдэдээ гэлтгүй гэр бүлийнхээ гишүүдэд, хайртай хүндээ эдгээр үгсийг хэлж хэвшээрэй. Үр дүнд нь амьдралд мэдэгдэхүйц эерэг өөрчлөлт гарах болно. `,
    negTitle: `Би чамд хайртай`,
    negText: `Хамгийн энгийн хэрнээ хүчтэй хайраа илэрхийлэх дээрх үгсийг өдөр тутамдаа хүүхдэдээ эхнэртээ, нөхөртөө, гэр бүлийнхэндээ хэлж байгаарай. Хүүхдэдээ бусдын хайрыг татсан, үнэ цэнэтэй хүн гэдгийг нь мэдрүүлэхийн тулд өдөр бүр хэлж байгаарай.`,
    hoyrTitle: `Чи бол чухал хүн`,
    hoyrText: `Хүүхэд бүр аав ээждээ хамгийн чухал хүн нь байдаг учраас чи минь ч гэсэн гэр бүлдээ аав ээждээ чухал хүн шүү гэж хэлж байх. Хүүхдийн өөртөө итгэх итгэлд ч мөн нөлөөлөх болно.`,
    guravTitle: `Би чамаар бахархаж байна`,
    guravText: `Хүүхдүүд эцэг эхийнхээ өөрөөр нь бахархаж байхыг сонсохыг хүсдэг. Тиймээс хүүхдийнхээ ахиц дэвшилийг анзаарч, хичээл зүтгэлийг нь магтах зэргээр  тэдэнд энэ талаар нь хэлэх цаг гаргаж байгаарай. `,
    duruvTitle: `Чамайг харсандаа баяртай байна`,
    duruvText: `Хичээлд нь хүргэж өгөөд авахдаа, орой уулзахдаа, өвөө эмээгийнхээс нь авахдаа гээд хэсэг хол байгаад эргэж уулзахдаа хэлж байгаарай. `,
    tavTitle: `Чамайг байгаад би үнэхээр талархаж байна`,
    tavText: `Та хүүхдэдээ хайртай гэдгээ мэдрүүлэхийн тулд эдгээр үгсийг хэлэх боломжийг битгий алдаарай. Талархлын мэдрэмж нь таны аз жаргалын түвшинг дээшлүүлж, харилцан халамжлах зан үйлийн эерэг тойргыг бий болгох болно. `,
  },
  {
    id: "10",
    title: "Яагаад хүүхэд бусдыг хаздаг вэ?",
    img: "/image10.png",
    subtitle: `Таны хүүхэд эд зүйлс эсвэл хэн нэгнийг хазаад байна уу? 0-3 насны хүүхэд хэн нэгнийг, эд зүйлийг хазах нь түгээмэл илэрдэг зан үйл юм.`,
    negTitle: `Шалтгаан`,
    negText: `Эд юмсыг ялгах, танин мэдэх хэрэгцээгээ хангах, шүдлэх үйл явцтай. Хүчтэй сэтгэл хөдлөл, мэдрэмжийг үгээр илэрхийлэх чадвар СУЛ байдаг учир уурласан, дургүйцсэн, гомдсон, бухимдсан, таагүй байдлаа илэрхийлэх арга нь болдог. Чанга дуу чимээ, эмх замбараагүй орчин түүнийг хазахад хүргэж болзошгүй. Аав ээжийн анхаарал, халамж дутагдах, гэр бүл дэх томоохон өөрчлөлтүүдийн (шинэ орчин, дүүтэй болох, салалт г.м) үед хазах нь элбэг.`,
    hoyrTitle: `1. Ямар үед хазаж байгааг ажиглах`,
    hoyrText: `Тоглоомоо булаацалдах, уурлах, эсэргүүцлээ илэрхийлэх, зөрчилдөх үедээ хазаж байна yy? Ямар нөхцөлд хүүхэд ийм зан үйл гаргаж байгааг мэддэг байх нь нөхцөл байдлыг өөрчлөх, өөр арга зам эрж олоход тусална. Цэцэрлэгийн эхний сард хүүхдүүдийн дунд хазах зуршил түгээмэл ажиглагддаг. Учир нь шинэ, өөр орчинд дасах, бусадтай хуваалцаж, хамтран тоглох, зөрчилдөөн үүсэх зэрэг шинэ сорилтуудад дасах хэрэгтэй болдог.`,
    guravTitle: `2. Богино, тодорхой хэлэх`,
    guravText: `1-3 насны хүүхдүүдэд хэлж буй шаардлагаа товч бөгөөд тодорхой хэлэх нь үр дүнтэй байдаг. “Миний хүү хазах нь буруу, муу зүйл, найзыгаа өвтгөчихлөө” гэж хэлэх нь энэ насны хүүхдүүдэд хэтэрхий урт анхааруулга болно.`,
    duruvTitle: `3. Сэтгэл хөдлөлөө илэрхийлэх үгийн санг баяжуулах`,
    duruvText: `Хүүхэд уур бухимдал, айдас, урам хугарах, дургүй байгаагаа илэрхийлэх үгийн сан бага байгаатай хазах зуршил шууд холбоотой. Тиймээс өөрт төрсөн мэдрэмжээ илэрхийлэх үгийг зааж өгөх хэрэгтэй. Хүүхэд сэтгэл хөдлөлөө үгээр илэрхийлэх үед дэмжээрэй. Учир нь хүүхэд сэтгэл хөдлөлөө үгээр илэрхийлсэн ч аав ээж нь тоолгүй өнгөрвөл “үгээр биш үйлдлээр илэрхийлэхээс өөр аргагүй” болно.`,
    tavTitle: `"Хүүхдийн хазах зуршил 4-с дээш насанд хэвээр байвал сэтгэл судлаач, хүүхдийн эмчээс зөвлөгөө аваарай."`,
    tavText: `Мөн хазах зуршлыг бэхжүүлдэг нэг гол хүчин зүйл нь “санасандаа хүрэх” явдал юм. Хэн нэгний хазаж тоглоомыг өөрийн болгох, өөрийн хүслийг гүйцэлдүүлэхийг зөвшөөрч болохгүй. Хазах нь санасандаа хүрэх арга нь байж болохгүй гэдгийг ойлгуулаарай. Цэцэрлэгт анх удаа явж байгаа бяцхануудад дасан зохицох хугацаа өгч, хамтран тоглох, бусадтай хуваалцах талаар зааж өгөөрэй. Учир нь хүүхдүүд цэцэрлэг дээрээ нэгнээ хазах нь маш түгээмэл байдаг юм шүү.`,
  },
  {
    id: "11",
    title: "Хэзээ сэтгэл зүйчид хандах вэ?",
    img: "/image11.jpeg",
    subtitle: `Хэзээ нэгэн цагт таны толгойд ‘за нэг сэтгэл зүйч дээр очиж үзье’ гэж бодогдож байсан л байх. Магадгүй заазаа дараа л больё, эсвэл жаахан л тэсчих юм бол бүх зүйл буцаад хэвэндээ орчихно байх гээд хүлээхээр шийддэг. Гэтэл үнэндээ цасан уулын уруу өнхрөх бөмбөлөг шиг цаг хугацаа өнгөрөх тусам асуудал улам даамжирч, дараа дараагийн асуудлуудыг үүсгэсээр байдаг.  Магадгүй одоохондоо хэн нэгэнтэй ярилцах нь үр дүнтэй санагдахгүй ч байж болно. Нийгмийн тогтсон хандлага, санхүүгийн байдал гэх мэт олон хүчин зүйлсээс хамаарч сэтгэл зүйчид хандах эсэхээ шийдэж чадахгүй байж болох юм. Хүн л болсон хойно сайн муу өдрүүд хүн болгонд тохиолддог шүү дээ.  Тэгвэл яг хэзээ тусламж хүсэх хэрэгтэй вэ гэдэг асуултад өнөөдрийн нийтлэлээрээ хариулахыг хичээлээ. Дараах жагсаалтаар сэтгэл зүйчид хандах шалтгаан нь хязгаарлагдахгүй ба энэхүү нийтлэл танд шийдвэр гаргахад туслах эхний алхам байх болно гэж итгэж байна.`,
    negTitle: `Сэтгэл зүйгээ удирдах нь `,
    negText: `Амьдралд тохиолдох олон саад бэрхшээл болон сөрөг бодол, зуршилдаа хүн төөрөх нь элбэг. Стресс ихсэх үед хүн мэдрэмждээ хэт автаж, тухайн асуудлаа үр дүнтэй даван туулах чадвар нь багасах талтай байдаг. Энэ үед сэтгэл зүйчтэй хамтран ажилласнаар та өөрийн бодол мэдрэмжээ ойлгож, үр дүнтэй даван туулах болон урьдчилан сэргийлэх аргад суралцдаг.`,
    hoyrTitle: `Сэтгэл хөдлөлөө барьж, зохицуулах хүндрэлтэй байх `,
    hoyrText: `Амьдрал стресс дунд өрнөдөг. Стресс бидний амьдрал өрнөхөд чухал үүрэгтэй төдийгүй сайнаар хүртэл нөлөөлдөг учир та амьдралдаа тохиолдох бүхий л стрессийг үгүй хийх боломжгүй.  Гэхдээ ямар ч зүйл ихдэхээрээ хор болдог шиг стресс ихтэй, түүнийгээ үр дүнтэй удирдаж чадахгүй байгаа бол та хэн нэгэнтэй ярилцахыг хүсэж болох юм. Удаан хугацаанд стресстэй явах нь хүнийг амархан цухалддаг, түргэн ууртай, үр бүтээмж муутай болох гэх мэт маш олон сөрөг талтай. Энэ тохиолдолд сэтгэл зүйчид хандасанаар стрессээ даван туулах эрүүл бөгөөд үр дүнтэй аргад суралцахаас гадна шаардлагагүй стрессийн эх сурвалжийг олж асуудал шийдвэрлэх, урьдчилан сэргийлэх боломжтой.`,
    guravTitle: `Танд мэдрэмжээ таньж мэдэх, зохицуулахад хүндрэлтэй байдаг`,
    guravText: `Түгшүүр, уур бухимдал, цухал гэх мэт тухгүй мэдрэмжүүд мэдэрч байх үедээ хүн өөрийгөө удирдахад хүндрэлтэй байх нь түгээмэл. Мэдрэмжээ тодорхойлж, удирдаж чадахгүй байгаагаас болоод таны гэр бүл, найз нөхөд, хос, ажлын газар гэх мэт газруудад таагүй нөхцөл байдал үүсэж, амьдралаа сэтгэл хангалуун үргэлжлүүлэхэд төвөгтэй болж байгаа бол энэ нь сэтгэл зүйчид хандах хэрэгцээг илтгэх болно.`,
    duruvTitle: `Сөрөг мэдрэмж, цаг үеийг даван туулахдаа та эрүүл бус арга барил ашигладаг`,
    duruvText: `Та сэтгэл санаа тавгүй үедээ их иддэг, эсвэл амьдралын хамаг ачаанаасаа түр ч болтугай зугтах гэж согтууруулах ундаа, сэтгэцэд нөлөөлөх эм бэлдмэл ашигладаг гэх мэтчилэн урт хугацаандаа нэмэлт асуудал үүсгэх аргаар та өөрийгөө хэсэг хугацаанд тайвшруулдаг бол сэтгэл зүйчид хандах цаг нь болсон. `,
    tavTitle: `Сэтгэл зүйчтэй хамтран таныг тухгүй болгодог мэдрэмж бодлоосоо зугтахаа больж, үр дүнтэй даван туулах болон урьдчилан сэргийлэх арга техникт хүн суралцдаг.`,
    tavText: ``,
  },
  {
    id: "12",
    title: "Зөвлөгөө авах сэтгэл зүйчээ сонгохдоо анхаарах зүйлс",
    img: "/image12.png",
    subtitle: `Сэтгэл зүйн зөвлөгөөний өрөөнд орж сэтгэл зүйчтэй нэг цагийн турш ярилцаж ‘өөртэйгөө ажиллах’ шийдвэрийг гаргах нь өөрөө тухайн хүнээс удаан хугацааны эрэл хайгуулаас гадна зориг шаардсан ажил байдаг. Тиймээс та нэгэнт өөрт тань сэтгэл зүйн тусламж үзүүлэх хэн нэгнийг хайж эхэлсэн бол энэхүү нийтлэл маань танд тусална гэдэгт итгэж байна. Та өөрийн зөвлөгөө авах сэтгэл зүйчийг сонгохдоо дараах зүйлсийг харгалзаж үзэхийг APA буюу Америкийн сэтгэл судлалын холбооноос хүргэж байна. Үүнд:`,
    negTitle: `Сэтгэл зүйчээ сонгоход чухал зүйл нь:`,
    negText: `Сэтгэл зүйч үйлчлүүлэгч хоёр хамтран ажилладаг учраас өөртөө тохирох зөв хүнээ олох нь чухал. Ихэнх сэтгэл судлаачдын санал нэгддэг зүйл бол үйлчлүүлэгчид сэтгэл зүйчийнхээ мэргэжлийн ур чадварыг батлах сертификат, батламжийг мэдэх нь тэдэнд илүү итгэл төрүүлдэг гэж үздэг. Сэтгэл зүйчтэйгээ харилцах харилцаа нь танд аюулгүй, тухтай, ойлгогдсон мэдрэмжийг өгөх нь чухал учраас өөртөө тохирох сэтгэл зүйчээ олохдоо үүнийг чухалчилж үзээрэй. Хэрэв сэтгэл зүйчтэйгээ уулзахад таныг ойлгохгүй байгаа юм шиг мэдрэмж төрж, зарим нэг ярих зүйлээ нуумаар санагдаж, хэлж болохгүй юм шиг мэдрэмж төрж байвал энэ талаараа сэтгэл зүйчдээ нээлттэй хэлж хамтдаа энэ асуудлыг шийдвэрлэхийг санал болгох бүрэн боломжтой гэдгийг санаарай. Түүнээс гадна сэтгэл зүйн зөвлөгөөг өгөх өрөө танхимд тавигддаг стандарт гэж байдаг. Хэрвээ таны хандаж байгаа сэтгэл зүйч ажлын өрөөнөөсөө бусад өөр газар, /ж.нь кофе шоп, олон хүнтэй задгай орчин гэх мэт/орчинд зөвлөгөө өгөхийг санал болгож байгаа бол үүнээс татгалзах зөвлөж байна.`,
    hoyrTitle: `Та сэтгэл зүйчээсээ дараах асуултыг асуух эрхтэй:`,
    hoyrText: `~ Танд сэтгэл зүйн зөвлөгөө өгөх тусгай эрх/лиценз/ байгаа юу? `,
    guravTitle: ``,
    guravText: `~ Би сүүлийн үед /түгшүүртэй, айдастай, сэтгэл гутралын/ -ийг мэдрэмжийг авахаас гадна  /ажил, хосын харилцаа, нойр, хоол/-ны хувьд асуудалтай нүүр тулаад байна. Танд ийм асуудалтай хүмүүстэй ажиллаж байсан туршлага байгаа юу? `,
    duruvTitle: ``,
    duruvText: `~ Та ямар чиглэлд илүү мэргэшсэн бэ? /жишээлбэл хүүхдүүдтэй илүү ажилладаг уу эсвэл гэр бүлтэй юу?/`,
    tavTitle: ``,
    tavText: `~ Сэтгэл зүйчээ сонгохдоо анхаарах бас нэг чухал зүйл нь таны найз эсвэл танилд тохирсон сэтгэл зүйч танд тохирно гэсэн баталгаа байхгүй тул “Сайн сэтгэл зүйч байна уу” гэж асуухаасаа өмнө өөрөө судалгаа хийж, өөрт тохирох сэтгэл зүйчийг олох нь чухал. Хүн болгон өөр учир хүн болгоны эдгэрэх арга, хамтарч ажиллах сэтгэл зүйчийн арга барил нь өөр гэдгийг санаарай. Өөрт тохирох сэтгэл зүйчээ олоход тань тус болох зорилгоор дараах жагсаалтыг гаргалаа.`,
  },
];

export default async function Page({
  params,
}: {
  params: Promise<{ id: string }>;
}) {
  const id = (await params).id;
  const findNiitlelById = allNiitlel.find((el) => el.id === id);

  return (
    <>
      <Niitlel1
        title={findNiitlelById?.title}
        img={findNiitlelById?.img}
        subtitle={findNiitlelById?.subtitle}
        negTitle={findNiitlelById?.negTitle}
        negText={findNiitlelById?.negText}
        hoyrTitle={findNiitlelById?.hoyrTitle}
        hoyrText={findNiitlelById?.hoyrText}
        guravTitle={findNiitlelById?.guravTitle}
        guravText={findNiitlelById?.guravText}
        duruvTitle={findNiitlelById?.duruvTitle}
        duruvText={findNiitlelById?.duruvText}
        tavTitle={findNiitlelById?.tavTitle}
        tavText={findNiitlelById?.tavText}
      />
      <div className="h-[1px] w-[800px] bg-[#213B4A]"></div>
      <div className="text-xl mb-[20px]">
        Өнөөдөр бүртгүүлээд сэтгэл зүйгээ дэмжих олон янзын сэдвүүдээс
        сонирхоорой.
      </div>
      <Link href={"/sign-up"}>
        <Button
          className="bg-[#FECE57] text-[#325343] items-center rounded-full
    w-[230px] text-center text-base font-bold font-['Inter'] leading-9 
    hover:bg-[#F9B927] transition-colors duration-300 ease-in-out mb-[40px]"
        >
          ХЯЛБАР БҮРТГЭЛ
        </Button>
      </Link>

      <Footer />
    </>
  );
}
